app/views/movies/search.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT ?  [["title", "The Lord of the Rings: The Fellowship of the Ring"], ["LIMIT", 1]]
---
  Similar Movies for
  <%= @movie.title.blank? ? "Movie" : @movie.title %>