app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (?, ?, ?, ?) ORDER BY release_date  [[nil, "G"], [nil, "PG"], [nil, "PG-13"], [nil, "R"]]
---
  def index
    @all_ratings = Movie.all_ratings

    session[:ratings] = @ratings = params[:ratings].try(:keys) || session[:ratings] || @all_ratings
    session[:sort] = @sort = params[:sort] || session[:sort]

    if @sort != params[:sort] || @ratings != params[:ratings]
      redirect_to movies_path(sort: @sort, ratings: @ratings)
    else
      @movies = Movie.where(rating: @ratings).order(@sort)

SELECT "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT ?  [["title", "Soul"], ["LIMIT", 1]]
---
  def search
    @similar_movies = Movie.find_by_title(params[:title])
    if @similar_movies.nil?
      redirect_to root_url, alert: "'#{params[:title]}' has no director information"
    end
    @movie = Movie.find_by(title: params[:title])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params.require(:id)
    @movie = Movie.find(id)

UPDATE "movies" SET "updated_at" = ?, "director" = ? WHERE "movies"."id" = ?  [["updated_at", "2022-05-21 10:36:47.331850"], ["director", "pleio"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)