app/models/movie.rb

SELECT "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT ?  [["title", "Soul"], ["LIMIT", 1]]
SELECT "movies"."title" FROM "movies" WHERE "movies"."director" = ?  [["director", "jh"]]
---
  def self.find_by_title movie_title
    director = Movie.find_by(title: movie_title).director
    return nil if director.blank? or director.nil?
    Movie.where(director: director).pluck(:title)